tap "code-hex/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "knqyf263/utern"
tap "linuxbrew/fonts"
tap "linuxbrew/xorg"
tap "rcmdnk/file"
tap "romkatv/powerlevel10k"
tap "waltarix/customs"
tap "wezterm/wezterm-linuxbrew"
brew "ncurses"
brew "libedit"
brew "openssl@3"
brew "unzip"
brew "perl"
brew "glib"
brew "apt"
brew "asdf"
brew "at-spi2-core"
brew "pkgconf"
brew "awscli"
brew "node"
brew "bitwarden-cli"
brew "cairo"
brew "clang-format"
brew "cmake"
brew "php"
brew "composer"
brew "ctop"
brew "cython"
brew "dagger"
brew "deno"
brew "direnv"
brew "gcc"
brew "dlib"
brew "docker"
brew "docker-compose"
brew "fd"
brew "flake8"
brew "flux"
brew "font-cica"
brew "font-noto-sans-cjk-jp", args: ["HEAD"]
brew "mesa"
brew "freeglut"
brew "fzf"
brew "git-lfs"
brew "go"
brew "gobject-introspection"
brew "openssl@1.1"
brew "pango"
brew "gtk+"
brew "gtk+3"
brew "openjdk"
brew "jmeter"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "librsvg"
brew "lpeg"
brew "lua"
brew "luajit"
brew "luarocks"
brew "mercurial"
brew "mmctl"
brew "mypy"
brew "mysql"
brew "tree-sitter"
brew "neovim"
brew "netpbm"
brew "newrelic-cli"
brew "nghttp2"
brew "node-build"
brew "nodenv"
brew "p7zip"
brew "peco"
brew "pipenv"
brew "postgresql@14"
brew "powerlevel10k"
brew "pv"
brew "pygobject3"
brew "python-tk@3.9"
brew "python-yq"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "srt"
brew "vte3"
brew "terminator", link: false
brew "tree"
brew "uv"
brew "watchman"
brew "xclip"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "code-hex/tap/neo-cowsay"
brew "knqyf263/utern/utern"
brew "wezterm/wezterm-linuxbrew/wezterm", args: ["HEAD"]
vscode "batisteo.vscode-django"
vscode "bigonesystems.django"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "thebarkman.vscode-djaneiro"
